{"sections":{"faq_template_v1":{"type":"FAQ-template","blocks":{"e8072367-458a-4ee7-a02e-1666e69687ee":{"type":"faq_left","settings":{"block_title_question":"What is Intense Pulsed Light (IPL) hair removal?","block_description_question":"IPL (Intense Pulsed Light) is a broadband pulsed light source that emits a beam of light that heats up the melanin in your hair follicles, damaging the root. With repeated use, IPL delays the production of new hair, preventing regrowth over time. The energy of the light, the frequency of use and the color of your hair are all determining factors in defining the effectiveness of IPL treatment. The best results are obtained on people with dark hair and fair skin. If you have sensitive or slightly darker skin, you may need to repeat the IPL process several times to achieve the desired result, as your skin needs to be treated with lower energy to avoid discomfort."}},"faq_left_6Mcegp":{"type":"faq_left","settings":{"block_title_question":"What are the advantages of IPL?","block_description_question":"IPL technology has advanced considerably and is no longer a luxury reserved for celebrities. Now you can enjoy smooth skin for up to 1 year in the comfort of your own home. The main benefits? IPL gives you smooth skin for 1 year. It's also convenient and done privately, so you can do it at your convenience. What's more, PROMED IPL lets you choose a gentle mode for first-time users or to treat sensitive areas like the bikini line."}},"faq_left_QApzJt":{"type":"faq_left","settings":{"block_title_question":"How long do IPL results last?","block_description_question":"When performed correctly and over a sufficient period of time, IPL hair removal can provide smooth skin for up to 1 year. IPL treatment persistence is essential: as hair grows on a growth cycle, repeated IPL treatments ensure that the hair root is targeted in the right growth phase, resulting in a steady reduction in hair growth over time. The result is long-lasting smooth skin."}},"faq_left_7HG7JY":{"type":"faq_left","settings":{"block_title_question":"How often should I use IPL at home?","block_description_question":"IPL only works on hair in the growth phase. For this reason, we recommend a start-up phase of 1 treatment per week for the first 4 to 12 weeks to achieve the best results. You should continue treatment after the first 4 weekly treatments if you notice that hair growth persists until you see no further regrowth. You can then continue the treatment with a touch-up session every 1-2 months, depending on your needs."}},"faq_left_fmfpFa":{"type":"faq_left","settings":{"block_title_question":"Can I use IPL for pubic hair?","block_description_question":"It's possible to use IPL on your bikini line, but it's not suitable for the genital area, where the skin may be darker or the hair density higher. These areas can absorb more light energy, resulting in greater discomfort."}},"faq_left_ejxLEU":{"type":"faq_left","settings":{"block_title_question":"Is IPL safe for dark and\/or brown skin?","block_description_question":"If you have dark or brown skin, your skin contains more melanin. Because darker skin contains more melanin, which absorbs more light energy, using IPL is not safe and may cause discomfort. Always consult the skin color and hair chart to find out if using IPL hair removal treatments is safe and effective for you. The PROMED IPL uses a SensoAdapt™ system that continuously and automatically ensures that only eligible skin color is treated. In general, IPL works best on people with dark hair and fair skin."}},"faq_left_Ch7EcC":{"type":"faq_left","settings":{"block_title_question":"Should I shave before IPL?","block_description_question":"Yes, we recommend shaving before an IPL treatment to avoid any discomfort during use."}},"faq_left_pRRMGC":{"type":"faq_left","settings":{"block_title_question":"Can the IPL device be used on the face?","block_description_question":"IPL hair removal treatment can be used gently on the face (for women), provided it is used under the cheekbones. It should not be used near the eyes or eyebrows. It can be used on the upper lip, chin and jaw line, but when using IPL on your face or any other sensitive area, always perform a patch test before treatment."}},"faq_left_HWkH6w":{"type":"faq_left","settings":{"block_title_question":"Is IPL safe for your eyesight?","block_description_question":"Yes, our PROMED IPL devices have been designed with your safety in mind. Your IPL device's light beam is triggered only when it comes into contact with the skin, and the light visible during treatment is perfectly safe. This means you don't need to wear protective eyewear."}}},"block_order":["e8072367-458a-4ee7-a02e-1666e69687ee","faq_left_6Mcegp","faq_left_QApzJt","faq_left_7HG7JY","faq_left_fmfpFa","faq_left_ejxLEU","faq_left_Ch7EcC","faq_left_pRRMGC","faq_left_HWkH6w"],"settings":{"enable_slide":true,"bg_breadcrumb":"shopify:\/\/shop_images\/FAQ-BANNER-IMAGE_2afbcca3-5912-4e52-a488-f764ad364506.jpg","enable_asked":true,"title_asked":"#Frequently asked questions","description_asked":"Get clear answers to common questions about IPL hair removal and how PROMED can help you achieve smooth, hair-free skin safely and effectively.","enable_newsletter":false,"section_title":"Never miss our updates about new arrivals and special offers","section_description":"Get the latest news & updates","newsletter_placeholder_input":"EMAIL ADDRESS","iconmail":"ti-email","button_name":"SUBCRIBE NOW"}},"section_newsletter_v1_cAhKey":{"type":"section-newsletter-v1","settings":{"enable_pd_small":true,"style_bg":"image","select_width":"full","bg_color":"#f2f2f2","bg_img":"shopify:\/\/shop_images\/WIN082585465487_97.jpg","mobile_bg_img":"shopify:\/\/shop_images\/WIN082584654.jpg","icon1":"fa fa-envelope-open-o","title_newletter":"Newsletter Signup","new_text":"Join our list and get 15% off your first purchase!","icon_button":"fa fa-paper-plane","margin_top":"0","margin_bottom":"0"}}},"order":["faq_template_v1","section_newsletter_v1_cAhKey"]}