{"sections":{"main":{"type":"main-page","disabled":true,"settings":{}},"image_with_text_banner_PHjBxY":{"type":"image-with-text-banner","settings":{"container":"container","hero_size":"small","show_overlay":true,"image":"shopify:\/\/shop_images\/refund_policy_page_banner_image.png","bg_position":"center","image_link":"","parallax":false,"content_in_container":true,"content_position":"left middle","d-text_alignment":"left","text_size":"medium","d-text-color":"white","m-text_color":"white","title":"Refund Policy","Heading-font_size":16,"m-heading-font_size":16,"subtitle":"","text":"","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","text_alignment_mobile":"center","use_content_above":false,"custom_class":"","animations":"inherit","enable_bg_zoom_effect":true}},"custom_rich_text_3PRWMc":{"type":"custom-rich-text","custom_css":["p {font-size: 20px !important;}","a {background: #222; color: #fff; padding: 10px 30px; margin-top: 20px; font-size: 18px;}","h3 {margin-top: 50px; margin-bottom: 30px;}"],"settings":{"container":"container","padding_top":50,"padding_bottom":50,"background_color":"rgba(0,0,0,0)","custom_liquid":"<p>PROMED manufactures its devices in accordance with good manufacturing practice.  Each device undergoes rigorous design, manufacturing, inspection and testing  procedures to ensure they meet our exact specifications. <\/p><p>If you are not completely satisfied with your PROMED product, please follow our  warranty and returns policy below: <\/p><h3><strong>Returns and refunds policy <\/strong><\/h3><p>PROMED devices may be returned within 30 days of purchase. Equipment received  damaged or used cannot be refunded. <\/p><p>If you received your product damaged during shipping, please retain the box and  damaged product(s) and initiate a return below. <\/p><p>We can only refund PROMED products purchased directly from www.pro-med.store. If you purchased from another retailer, please contact them directly for  information on their returns policy. <\/p><p>For all refunds and returns, the serial number and proof of purchase are required. <\/p><p><\/p><h3><a href=\"https:\/\/pro-med.store\/apps\/yanet-return\" title=\"https:\/\/pro-med.store\/apps\/yanet-return\">Submit a Return Inquiry<\/a><\/h3><h3><strong>Warranty policy <\/strong><\/h3><p>PROMED will replace genuine devices eligible for warranty service. Each device  includes a 30-day money-back guarantee and a one-year guarantee covering any  manufacturer-related problems resulting from daily use of the product. Guarantees  are only valid for items purchased from our site and accompanied by a receipt for  the product. This warranty is void if the product has been subject to accident,  misuse, improper maintenance or repair, unauthorised modification or any other use  not specified in the printed instructions. <\/p><h3><strong>Return conditions <\/strong><\/h3><p>1. To request a return and refund, please contact us directly at  contacts@pro-med.store. <\/p><p>2. Returns must be approved in advance before a refund or exchange can be  considered. Items returned without prior authorisation will not be accepted  and shipping costs will be your responsibility. <\/p><p>3. The device you wish to return must be in the same condition as when  you received it. This means that it must not be damaged and that it must be accompanied by its original packaging. Failure to comply with these conditions may result in additional costs or make it impossible to return the product. <\/p><p>4. Requests for returns must be made within 30 days of the date of  purchase. <\/p><p>5. Keep the original packaging <\/p><p>To initiate the returns procedure, please provide the following information by email: <br\/><br\/>- Your order number. <\/p><p>- The reason for the return or exchange. <\/p><p>- The number of products you wish to return. <\/p><p>- Clear photos of the returned product(s), sharp enough to enable us to assess their  condition. <\/p><p>- If you have kept the original packaging, these photos must also be included so that we can assess the condition of the product.<\/p>","custom_class":""}},"custom_liquid_gymPd8":{"type":"custom-liquid","disabled":true,"settings":{"container":"container-fluid","padding_top":50,"padding_bottom":50,"background_color":"rgba(0,0,0,0)","custom_liquid":"<body>\n\n    <style>\n\n\n\n\n.image-text-section {\n    display: flex;\n    flex-wrap: wrap;\n    align-items: center;\n    justify-content: center;\n    background-color: #fff;\n    padding: 20px;\n    border-radius: 8px;\n    box-shadow: 0 4px 6px rgba(0, 0, 0, 0.1);\n    margin: auto;\n}\n\n.image-container {\n    flex: 1;\n    min-width: 250px;\n    margin-bottom: 20px;\n}\n\n.image-container img {\n    max-width: 100%;\n    height: auto;\n    border-radius: 8px;\n}\n\n.text-container {\n    flex: 1;\n    padding: 0 20px;\n    min-width: 250px;\n}\n\n.text-container h2 {\n    font-size: 24px;\n    margin-bottom: 10px;\n}\n\n.text-container p {\n    font-size: 16px;\n    color: #555;\n}\n\n\/* Responsive Design for Smaller Screens *\/\n@media (max-width: 768px) {\n    .image-text-section {\n        flex-direction: column;\n        padding: 15px;\n    }\n\n    .text-container {\n        padding: 0;\n        text-align: center;\n    }\n\n    .text-container p {\n        font-size: 14px;\n    }\n}\n\n    <\/style>\n \n    <div class=\"image-text-section\">\n        <div class=\"image-container\">\n            <img src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0658\/8976\/3480\/files\/businesswomen-cafe500-700.png?v=1727510410\" alt=\"Sample Image\">\n        <\/div>\n        <div class=\"text-container\">\n            <p>\n                Our story begins with two sisters, united by personal challenges and a determination to change their lives. One of us has long suffered from excessive hair growth, while the other faced the effects of polycystic ovary syndrome. These experiences have confronted us with daily struggles that impacted our confidence and well-being.\n                One day, after hearing about intense pulsed light (IPL) hair removal, we decided to explore this revolutionary technology. What we discovered profoundly changed our perception of hair removal: IPL laser offers a solution that is not only effective and long-lasting but also gentle and safe for the skin. Thanks to thorough research and technological advancements, this method allows for the targeting of hair follicles while preserving the integrity of the surrounding skin.\n            \n                Empowered by this discovery, we decided to embark on this entrepreneurial journey. We created our company with the mission of providing the highest quality IPL laser hair removal treatments that are accessible and tailored to everyone’s needs. We selected state-of-the-art devices to ensure maximum effectiveness and optimal comfort for our clients. Our goal was simple: to help people free themselves from the insecurities related to hair growth and regain their confidence.\n                \n                Each treatment we offer is infused with our story and our passion, as well as our commitment to excellence. We understand what it means to feel uncomfortable in your own skin, and we are dedicated to providing a warm and supportive experience for each of our clients. Our technical expertise, combined with our empathy, allows us to support our clients at every step of their journey.\n                \n                Today, our company is much more than just a business; it reflects our resilience and our desire to transform lives. We are proud to offer a solution that has been a true remedy for us.\n                \n                Welcome to our world, where every client is at the heart of our mission, and where we celebrate the beauty of every journey together.\n            <\/p>\n        <\/div>\n    <\/div>\n\n    \n<\/body>","custom_class":""}}},"order":["main","image_with_text_banner_PHjBxY","custom_rich_text_3PRWMc","custom_liquid_gymPd8"]}